package com.green.day11.ch15;

public class ObjectRelation {
    /*
    [객체간의 관계]
    1)is-A: 상속으로 처리
    2)has-A: 멤버필드로 처리

    ex)
    1) 모바일폰, 스마트폰의 관계
       모바일폰 is 스마트폰 -> 어색하지 않으므로 이것은 is-A 관계라 한다. (상속으로 처리)

    2) 검사, 캐릭터 관계
       검사 is 캐릭터 -> 어색하지 않으므로 is-A 관계 (상속으로 처리)

    3) 스피커, 자동차의 관계
       자동차 is 스피커 -> 어색하다
       자동차 has 스피커 -> 어색하지 않으므로 has-A 관계

    4) 검사, 검 관계
       검사 is 검 -> 어색하다
       검사 has 검 -> 어색하지 않으므로 has-A 관계


     이런 is-A 로 처리할지, has-A 로 처리할지는 온전히 개발자한테 달려있다.
     관리가 유리한대로 하면 된다.
     보통 말로 만들었을때 어색하지 않는 문장은 관계를 설정하지만 100% 는 아니다.
     */
}
